; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	image3 - mode
	infrared0 - mode
	infrared4 - mode
	infrared1 - mode
	thermograph2 - mode
	GroundStation3 - direction
	Star2 - direction
	Star0 - direction
	GroundStation4 - direction
	Star1 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Planet21 - direction
	Planet22 - direction
	Star23 - direction
	Star24 - direction
	Phenomenon25 - direction
	Star26 - direction
	Star27 - direction
	Star28 - direction
	Star29 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared4)
	(supports instrument1 image3)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument3 infrared4)
	(supports instrument3 infrared0)
	(supports instrument3 image3)
	(calibration_target instrument3 Star1)
	(supports instrument4 image3)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 infrared4)
	(supports instrument5 infrared0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet22)
	(supports instrument6 image3)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star0)
	(supports instrument7 image3)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
	(supports instrument8 thermograph2)
	(supports instrument8 infrared4)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star23)
	(supports instrument9 thermograph2)
	(supports instrument9 infrared4)
	(calibration_target instrument9 Star0)
	(supports instrument10 infrared1)
	(supports instrument10 thermograph2)
	(supports instrument10 infrared4)
	(calibration_target instrument10 GroundStation4)
	(supports instrument11 thermograph2)
	(calibration_target instrument11 Star1)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star9)
)
(:goal (and
	(pointing satellite0 Star26)
	(pointing satellite1 Planet13)
	(pointing satellite3 Planet13)
	(have_image Star5 infrared4)
	(have_image Planet6 thermograph2)
	(have_image Planet7 thermograph2)
	(have_image Star9 infrared0)
	(have_image Phenomenon10 infrared1)
	(have_image Star11 image3)
	(have_image Phenomenon12 infrared1)
	(have_image Planet13 infrared4)
	(have_image Star14 infrared0)
	(have_image Planet15 thermograph2)
	(have_image Phenomenon17 infrared0)
	(have_image Planet18 thermograph2)
	(have_image Planet19 infrared0)
	(have_image Phenomenon20 thermograph2)
	(have_image Planet21 infrared4)
	(have_image Planet22 image3)
	(have_image Star23 infrared4)
	(have_image Star24 infrared4)
	(have_image Phenomenon25 image3)
	(have_image Star26 infrared1)
	(have_image Star27 infrared4)
	(have_image Star28 image3)
	(have_image Star29 infrared0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 26
2. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 26
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 26
4. (turn_to satellite4 groundstation4 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 groundstation4)
   goals met: 0 of 26
5. (calibrate satellite4 instrument10 groundstation4)
   added: (calibrated instrument10)
   goals met: 0 of 26
6. (turn_to satellite4 phenomenon10 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 26
7. (take_image satellite4 phenomenon10 instrument10 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 1 of 26
8. (turn_to satellite4 phenomenon12 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 26
9. (take_image satellite4 phenomenon12 instrument10 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 2 of 26
10. (turn_to satellite4 phenomenon20 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon20)
   goals met: 2 of 26
11. (take_image satellite4 phenomenon20 instrument10 thermograph2)
   added: (have_image phenomenon20 thermograph2)
   goals met: 3 of 26
12. (turn_to satellite4 planet13 phenomenon20)
   deleted: (pointing satellite4 phenomenon20)
   added: (pointing satellite4 planet13)
   goals met: 3 of 26
13. (take_image satellite4 planet13 instrument10 infrared4)
   added: (have_image planet13 infrared4)
   goals met: 4 of 26
14. (turn_to satellite4 planet15 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet15)
   goals met: 4 of 26
15. (take_image satellite4 planet15 instrument10 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 5 of 26
16. (turn_to satellite4 planet18 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet18)
   goals met: 5 of 26
17. (take_image satellite4 planet18 instrument10 thermograph2)
   added: (have_image planet18 thermograph2)
   goals met: 6 of 26
18. (turn_to satellite4 planet21 planet18)
   deleted: (pointing satellite4 planet18)
   added: (pointing satellite4 planet21)
   goals met: 6 of 26
19. (take_image satellite4 planet21 instrument10 infrared4)
   added: (have_image planet21 infrared4)
   goals met: 7 of 26
20. (turn_to satellite4 planet6 planet21)
   deleted: (pointing satellite4 planet21)
   added: (pointing satellite4 planet6)
   goals met: 7 of 26
21. (take_image satellite4 planet6 instrument10 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 8 of 26
22. (turn_to satellite4 planet7 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet7)
   goals met: 8 of 26
23. (take_image satellite4 planet7 instrument10 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 9 of 26
24. (turn_to satellite4 star23 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star23)
   goals met: 9 of 26
25. (take_image satellite4 star23 instrument10 infrared4)
   added: (have_image star23 infrared4)
   goals met: 10 of 26
26. (turn_to satellite4 star24 star23)
   deleted: (pointing satellite4 star23)
   added: (pointing satellite4 star24)
   goals met: 10 of 26
27. (take_image satellite4 star24 instrument10 infrared4)
   added: (have_image star24 infrared4)
   goals met: 11 of 26
28. (turn_to satellite4 star26 star24)
   deleted: (pointing satellite4 star24)
   added: (pointing satellite4 star26)
   goals met: 11 of 26
29. (take_image satellite4 star26 instrument10 infrared1)
   added: (have_image star26 infrared1)
   goals met: 12 of 26
30. (turn_to satellite4 star27 star26)
   deleted: (pointing satellite4 star26)
   added: (pointing satellite4 star27)
   goals met: 12 of 26
31. (take_image satellite4 star27 instrument10 infrared4)
   added: (have_image star27 infrared4)
   goals met: 13 of 26
32. (turn_to satellite4 star5 star27)
   deleted: (pointing satellite4 star27)
   added: (pointing satellite4 star5)
   goals met: 13 of 26
33. (take_image satellite4 star5 instrument10 infrared4)
   added: (have_image star5 infrared4)
   goals met: 14 of 26
34. (turn_to satellite3 planet13 star23)
   deleted: (pointing satellite3 star23)
   added: (pointing satellite3 planet13)
   goals met: 15 of 26
35. (turn_to satellite2 phenomenon25 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 phenomenon25)
   goals met: 15 of 26
36. (turn_to satellite2 star2 phenomenon25)
   deleted: (pointing satellite2 phenomenon25)
   added: (pointing satellite2 star2)
   goals met: 15 of 26
37. (calibrate satellite2 instrument7 star2)
   added: (calibrated instrument7)
   goals met: 15 of 26
38. (turn_to satellite2 phenomenon25 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon25)
   goals met: 15 of 26
39. (take_image satellite2 phenomenon25 instrument7 image3)
   added: (have_image phenomenon25 image3)
   goals met: 16 of 26
40. (turn_to satellite2 planet22 phenomenon25)
   deleted: (pointing satellite2 phenomenon25)
   added: (pointing satellite2 planet22)
   goals met: 16 of 26
41. (take_image satellite2 planet22 instrument7 image3)
   added: (have_image planet22 image3)
   goals met: 17 of 26
42. (turn_to satellite2 star11 planet22)
   deleted: (pointing satellite2 planet22)
   added: (pointing satellite2 star11)
   goals met: 17 of 26
43. (take_image satellite2 star11 instrument7 image3)
   added: (have_image star11 image3)
   goals met: 18 of 26
44. (turn_to satellite2 star28 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star28)
   goals met: 18 of 26
45. (take_image satellite2 star28 instrument7 image3)
   added: (have_image star28 image3)
   goals met: 19 of 26
46. (turn_to satellite1 planet13 planet22)
   deleted: (pointing satellite1 planet22)
   added: (pointing satellite1 planet13)
   goals met: 20 of 26
47. (turn_to satellite0 groundstation3 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation3)
   goals met: 20 of 26
48. (calibrate satellite0 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 20 of 26
49. (turn_to satellite0 phenomenon17 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon17)
   goals met: 20 of 26
50. (take_image satellite0 phenomenon17 instrument2 infrared0)
   added: (have_image phenomenon17 infrared0)
   goals met: 21 of 26
51. (turn_to satellite0 planet19 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet19)
   goals met: 21 of 26
52. (take_image satellite0 planet19 instrument2 infrared0)
   added: (have_image planet19 infrared0)
   goals met: 22 of 26
53. (turn_to satellite0 star14 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 star14)
   goals met: 22 of 26
54. (take_image satellite0 star14 instrument2 infrared0)
   added: (have_image star14 infrared0)
   goals met: 23 of 26
55. (turn_to satellite0 star26 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star26)
   goals met: 24 of 26
56. (turn_to satellite0 star29 star26)
   deleted: (pointing satellite0 star26)
   added: (pointing satellite0 star29)
   goals met: 23 of 26
57. (take_image satellite0 star29 instrument2 infrared0)
   added: (have_image star29 infrared0)
   goals met: 24 of 26
58. (turn_to satellite0 star26 star29)
   deleted: (pointing satellite0 star29)
   added: (pointing satellite0 star26)
   goals met: 25 of 26
59. (turn_to satellite0 star9 star26)
   deleted: (pointing satellite0 star26)
   added: (pointing satellite0 star9)
   goals met: 24 of 26
60. (take_image satellite0 star9 instrument2 infrared0)
   added: (have_image star9 infrared0)
   goals met: 25 of 26
61. (turn_to satellite0 star26 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star26)
   goals met: 26 of 26
